bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA645.xml
            <value-group caption="" name="COMM_USART_MODE">
                <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
            </value-group>
            <value-group caption="" name="COMM_UPM_PARITY_MODE">
                <value caption="Disabled" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
                <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_STOP_BIT_SEL">
                <value caption="1-bit" name="VAL_0x00" value="0x00"/>
                <value caption="2-bit" name="VAL_0x01" value="0x01"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="QFP_QFN_64">
            <pin pad="NC" position="1"/>
            <pin pad="PE0" position="2"/>
            <pin pad="PE1" position="3"/>
            <pin pad="PE2" position="4"/>
            <pin pad="PE3" position="5"/>
            <pin pad="PE4" position="6"/>
            <pin pad="PE5" position="7"/>
            <pin pad="PE6" position="8"/>
            <pin pad="PE7" position="9"/>
            <pin pad="PB0" position="10"/>
            <pin pad="PB1" position="11"/>
            <pin pad="PB2" position="12"/>
            <pin pad="PB3" position="13"/>
            <pin pad="PB4" position="14"/>
            <pin pad="PB5" position="15"/>
            <pin pad="PB6" position="16"/>
            <pin pad="PB7" position="17"/>
            <pin pad="PG3" position="18"/>
            <pin pad="PG4" position="19"/>
            <pin pad="PG5" position="20"/>
            <pin pad="VCC" position="21"/>
            <pin pad="GDN" position="22"/>
            <pin pad="XTAL2" position="23"/>
            <pin pad="XTAL1" position="24"/>
            <pin pad="PD0" position="25"/>
            <pin pad="PD1" position="26"/>
            <pin pad="PD2" position="27"/>
            <pin pad="PD3" position="28"/>
            <pin pad="PD4" position="29"/>
            <pin pad="PD5" position="30"/>
            <pin pad="PD6" position="31"/>
            <pin pad="PD7" position="32"/>
            <pin pad="PG0" position="33"/>
            <pin pad="PG1" position="34"/>
            <pin pad="PC0" position="35"/>
            <pin pad="PC1" position="36"/>
            <pin pad="PC2" position="37"/>
            <pin pad="PC3" position="38"/>
            <pin pad="PC4" position="39"/>
            <pin pad="PC5" position="40"/>
            <pin pad="PC6" position="41"/>
            <pin pad="PC7" position="42"/>
            <pin pad="PG2" position="43"/>
            <pin pad="PA7" position="44"/>
            <pin pad="PA6" position="45"/>
            <pin pad="PA5" position="46"/>
            <pin pad="PA4" position="47"/>
            <pin pad="PA3" position="48"/>
            <pin pad="PA2" position="49"/>
            <pin pad="PA1" position="50"/>
            <pin pad="PA0" position="51"/>
            <pin pad="VCC" position="52"/>
            <pin pad="GND" position="53"/>
            <pin pad="PF7" position="54"/>
            <pin pad="PF6" position="55"/>
            <pin pad="PF5" position="56"/>
            <pin pad="PF4" position="57"/>
            <pin pad="PF3" position="58"/>
            <pin pad="PF2" position="59"/>
            <pin pad="PF1" position="60"/>
            <pin pad="PF0" position="61"/>
            <pin pad="AREF" position="62"/>
            <pin pad="GND" position="63"/>
            <pin pad="AVCC" position="64"/>
        </pinout>
    </pinouts>
</target-description-file>
